def F(str):
    n = len(str)                    # 字符串总长度
    T = [1] * n                     # 初始化周期表，主要是把第 0 位的周期设为 1

    for i in range(1, n):           # 从1开始填表

        P = T[i-1]                  # 旧的周期

        if str[i] == str[i-P]:      # [周期维持]
            T[i] = P
        
        else:                       # [周期打破]
            # 通常情况周期会被彻底打破, 新周期直接等于新串长度
            # 比如 F("aaaabaaaac") == [1,1,1,1,5,5,5,5,5,10]
            #
            # 存在一些情况, 原周期被打破的同时, 新字符和前面的字符拼接产生了新的周期;
            # 比如 F("aabaaaba") = [1,1,3,3,3,4,4,4]
            #
            # 此时的状态:
            #
            # 11333↓(i)
            # aabaaaba
            #   ↑(i-P)
            # 
            # 为了方便分析,我们把字符串复制一份,并对齐箭头:
            #
            # 11333↓(i)
            # aabaaaba
            #    aabaaaba
            #      ↑(i-P)
            #
            # 发现这个过程和字符串匹配一模一样;
            # 其实周期分析本质就是拿字符串和平移后的自己做匹配;
            # 匹配成功时, 偏移距离就是周期值;
            # 连续匹配成功时, 两个串的偏移距离不变, 周期值一直重复;
            # 匹配失败时需增大偏移量, 寻找到下一个匹配位置:
            #
            # 113334↓(i)
            # aabaaaba
            #     aabaaaba
            #       ↑(i-P)

            # 故按匹配失败跳转规则获取新的偏移距离:

            next = (i-P) % T[i-P]   # 失败位周期取模

            if next == 0:           # 处理边界情况
                next = -1
            else:
                next -= T[next-1]   # 获取最终跳转位

            T[i] = i-next           # 计算偏移

            # 此方法覆盖了所有情况，故可删掉开头的情况

    return T


if __name__ == "__main__":
    print(F("aabaaaba"))
    # 预期输出: [1, 1, 3, 3, 3, 4, 4, 4]